export const MESSAGES = {
  hello:
    "Привет! Я Тайсон, и я здесь, чтобы помочь тебе погрузиться в мир экосистемы DMT. 🌟 Давай вместе исследуем все ее особенности, возможности и уникальные токены!",
  error:
    "Упс! Похоже, что-то пошло не так. 🤖 Давай попробуем еще раз и всё обязательно получится!",
  processing: `Сообщение получено, работаю над ответом...💭  Оставайся на связи!`,
  goodbye:
    "Было приятно помочь! Сбрасываю сессию, но всегда готов к новой встрече. Удачи и до связи! 👋",
  dmtAndEcosystem: `
ДМТ – это команда, работающая над проектом, а также её основатель. Команда ведет следующие проекты:

- *ДМТ*
- *Лягушка*
- *Ликвидатор*

Другие команды работают независимо и не подчиняются ДМТ. Они включают:

- *Токены-партнеры* – дружеские команды, с которыми у нас есть общие механики, задания или события.
- *Дружественные токены и сообщества*
- *Участники ДМТ лиги* – [https://t.me/dmt_community_bot?start=ref_66698a601a9bf1e3fca29048](https://t.me/dmt_community_bot?start=ref_66698a601a9bf1e3fca29048)
- *И многое другое*

Все токены и команды выше – отличные, сам держу много их токенов, всегда рад поддержать советом и нужным толчком, но это исключительно дружеские жесты.
`,
  purchaseDmtAndTokens: `
Используйте – [свап кофи](https://swap.coffee/dex?referral=user_UQC8oun2zkOaRaz8Xecn-2Pl5y077tJs07yDu31aXjd0PKcI), чтобы обменять ТОН или другие токены на наши токены экосистемы.

*Важно*: используйте именно свап кофи.
Если купите через другие платформы, арбитражные боты могут съесть часть цены.
`,
  whatAreLpTokens: `
LP-токены – это *токены пулов ликвидности*.
Они выдаются пользователям за вложение активов в пулы ликвидности и представляют собой своего рода квитанцию,
с помощью которой провайдер может вернуть внесенные средства вместе с заработанными процентами.

LP-токены можно использовать для:

- *Фарминга доходности* \\(заработок процентов\\)
- *Получения криптозаймов*
- *Передачи права собственности на ликвидность в стейкинге*

❗️ *Важно*: после передачи LP-токенов другому лицу, вы перестанете владеть соответствующей ликвидностью.

*Простыми словами, ликвидность – это возможность свободно торговать активом без значительных изменений цены.*
`,
  fundLiquidityPool: `
1. Купите *равное количество пары токенов* на сумму, эквивалентную доллару.
2. Перейдите на [DeDust](https://dedust.io/pools/) и найдите нужный вам пул.
`,
  liquidityAndFreezeInfo: `
Для начала вам нужно:

- [купить](https://swap.coffee/dex?referral=user_UQBgFqGmjTI8Dqi7axFAw--26-2nRMQd-R_rnV-3iZdGMHyQ) определенную пару токенов, которые вы хотите положить в пул, условно ICE и DMT;
- перейти на [dedust](https://dedust.io/pools) и во вкладке «Pools» найти ту самую пару, в данном кейсе это будет [ICE/DMT](https://dedust.io/pools/EQDE70EgnExfN01svQd-DpF0fpz9jNoq7RahBpTCGgagzwDQ);
- сделать депозит двух токенов в равном эквиваленте в USDT.

После депозита ваших токенов в пул ликвидности биржа предоставляет вам LP-токены, которые представляют вашу долю в пуле. Чем больше ликвидность токена, тем менее волатильный будет токен, именно поэтому за пулы ликвидности предоставляются бусты, те самые награды, которые вы можете клеймить на Dedust.

После предоставления своих токенов пулу ликвидности вам начнут начисляться награды исходя из вашей позиции в пуле, которые зависят от текущего APR.

Также с помощью приложения вы можете зафризить ваши LP-токены, тем самым получить дополнительные % сверх к тем процентам, которые предоставляются на dedust.

Условно говоря, на данный момент APR пула ICE/TON равен 12.16%, зафризив ваши LP-токены в [приложении](https://t.me/IceCommunityBot), вы сверх этого получите дополнительные 560%.

Анфриз токенов происходит по истечению срока предоставления фриза, в первый вторник или пятницу, который выпадает после вашего фриза.

Награды с фризов мы дропаем после того, как там накапливается достаточная сумма. Мы это делаем вручную, так что конкретных дат нет, но каждый дроп мы освещаем, так что вы точно не пропустите.
`,
};
